*** number-sequence
    类似 python 的 range 函数
    #+BEGIN_QUOTE
    ~(number-sequence FROM TO INC)~
    #+END_QUOTE

    #+BEGIN_SRC elisp
    (number-sequence 10 20)
    #+END_SRC

    #+RESULTS:
    | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20 |


    #+BEGIN_SRC elisp
    (number-sequence 10 20 3)
    #+END_SRC

    #+RESULTS:
    | 10 | 13 | 16 | 19 |


    #+BEGIN_SRC elisp
    (number-sequence 20 10 -1)
    #+END_SRC

    #+RESULTS:
    | 20 | 19 | 18 | 17 | 16 | 15 | 14 | 13 | 12 | 11 | 10 |

*** let
Declare that a list of variables is for use within the body of the ~let~ and
give them an initial value, either nil or a specified value; then evaluate the
rest of the expressions in the body of the let and return the value of the last
one. Inside the body of the let, the Lisp interpreter does not see the values of
the variables of the same names that are bound outside of the let. For example,

#+BEGIN_SRC elisp
          (let ((foo (buffer-name))
                (bar (buffer-size)))
            (message
             "This buffer is %s and has %d characters."
             foo bar))
#+END_SRC

#+RESULTS:
: This buffer is some useful elisp fn.org and has 16811 characters.

